In [ ]:
import sqlite3

In [ ]:
conn=sqlite3.connect('test.db')

In [ ]:
conn.execute('''
  CREATE TABLE Departments(
    Code INTERGER PRIMARY KEY NOT NULL,
    name NVARCHAR NOT NULL,
    Budget REAL NOT NULL
  ); '''
)
conn.commit ()
print('Departments Table Created');

Departments Table Created

In [ ]:
conn.execute('''
  CREATE TABLE Employees(
    SSN INTEGER PRIMARY KEY NOT NULL,
    name Text NOT NULL,
    LastName VARCHAR NOT NULL,
    Department INTEGER NOT NULL,
    Salary INTEGER NOT NULL,
    CONSTRAINT fk_Departments FOREIGN KEY (Department) REFERENCES Departments(Code)
  ); '''
)
conn.commit ()
print('Employees Table Created');

Employees Table Created

In [ ]:
conn.execute('INSERT INTO Departments(Code,Name,Budget) VALUES(14,"IT",65000);')
conn.execute('INSERT INTO Departments(Code,Name,Budget) VALUES(37,"Accounting",15000);')
conn.execute('INSERT INTO Departments(Code,Name,Budget) VALUES(59,"Human Resources",240000);')
conn.execute('INSERT INTO Departments(Code,Name,Budget) VALUES(77,"Research",55000);')

In [ ]:
conn.execute('INSERT INTO Employees(SSN,Name,LastName,Department,Salary) VALUES(152934485,"Anand","Manikutty",14,300);')
conn.execute('INSERT INTO Employees(SSN,Name,LastName,Department,Salary) VALUES(222364883,"Carol","Smith",37,200);')
conn.execute('INSERT INTO Employees(SSN,Name,LastName,Department,Salary) VALUES(326587417,"Joe","Stevens",37,150);')
conn.execute('INSERT INTO Employees(SSN,Name,LastName,Department,Salary) VALUES(332154719,"Mary-Anne","Foster",14,500);')
conn.execute('INSERT INTO Employees(SSN,Name,LastName,Department,Salary) VALUES(332569843,"George","O''Donnell",77,140);')
conn.execute('INSERT INTO Employees(SSN,Name,LastName,Department,Salary) VALUES(546523478,"John","Doe",59,800);')
conn.execute('INSERT INTO Employees(SSN,Name,LastName,Department,Salary) VALUES(631231482,"David","Smith",77,900);')
conn.execute('INSERT INTO Employees(SSN,Name,LastName,Department,Salary) VALUES(654873219,"Zacary","Efron",59,600);')
conn.execute('INSERT INTO Employees(SSN,Name,LastName,Department,Salary) VALUES(745685214,"Eric","Goldsmith",59,130);')
conn.execute('INSERT INTO Employees(SSN,Name,LastName,Department,Salary) VALUES(845657245,"Elizabeth","Doe",14,120);')
conn.execute('INSERT INTO Employees(SSN,Name,LastName,Department,Salary) VALUES(845657246,"Kumar","Swamy",14,500);')
conn.commit()

In [ ]:
conn=sqlite3.connect('test.db')
cursor=conn.execute('''select * from Departments''')
for row in cursor:
  print(row)

(14, 'IT', 65000.0)
(37, 'Accounting', 15000.0)
(59, 'Human Resources', 240000.0)
(77, 'Research', 55000.0)

In [ ]:
cursor=conn.execute('''select * from Employees''')
for row in cursor:
  print(row)

(123234877, 'Michael', 'Rogers', 14, 100)
(152934485, 'Anand', 'Manikutty', 14, 300)
(222364883, 'Carol', 'Smith', 37, 200)
(326587417, 'Joe', 'Stevens', 37, 150)
(332154719, 'Mary-Anne', 'Foster', 14, 500)
(332569843, 'George', 'ODonnell', 77, 140)
(546523478, 'John', 'Doe', 59, 800)
(631231482, 'David', 'Smith', 77, 900)
(654873219, 'Zacary', 'Efron', 59, 600)
(745685214, 'Eric', 'Goldsmith', 59, 130)
(845657245, 'Elizabeth', 'Doe', 14, 120)
(845657246, 'Kumar', 'Swamy', 14, 500)

In [ ]:
cursor=conn.execute('''
  SELECT * FROM Employees
  WHERE Department IN(37,77); ''')
for row in cursor:
  print(row)

(222364883, 'Carol', 'Smith', 37, 200)
(326587417, 'Joe', 'Stevens', 37, 150)
(332569843, 'George', 'ODonnell', 77, 140)
(631231482, 'David', 'Smith', 77, 900)

In [ ]:
cursor=conn.execute('''
  SELECT Name FROM Departments
  WHERE Code IN
  (SELECT Department
  From Employees
  GROUP BY Department
  HAVING COUNT(*)>2
  );
  ''')
for row in cursor:
  print(row)

('IT',)
('Human Resources',)

In [ ]:
conn.execute('''
  ALTER TABLE Employees ADD qualifications VARCHAR;
 ''')
conn.commit ()
print('column added')

column added

In [ ]:
conn.execute('INSERT INTO Employees(SSN,Name,LastName,Department,Salary, Qualifications) VALUES(222364884,"Carol","Smith",37,200, "mechanic");')
conn.commit ()
print('column added')

column added

In [ ]:
cursor = conn.execute('''
SELECT SSN, Name FROM Employees
ORDER BY Department;
  ''')
for row in cursor:
  print(row)

(152934485, 'Anand')
(332154719, 'Mary-Anne')
(845657245, 'Elizabeth')
(845657246, 'Kumar')
(222364883, 'Carol')
(326587417, 'Joe')
(546523478, 'John')
(654873219, 'Zacary')
(745685214, 'Eric')
(332569843, 'George')
(631231482, 'David')

In [ ]:
cursor=conn.execute('''
SELECT SSN, Name FROM  Employees
ORDER BY Department,Salary;
  ''')
for row in cursor:
  print(row)

(845657245, 'Elizabeth')
(152934485, 'Anand')
(332154719, 'Mary-Anne')
(845657246, 'Kumar')
(326587417, 'Joe')
(222364883, 'Carol')
(745685214, 'Eric')
(654873219, 'Zacary')
(546523478, 'John')
(332569843, 'George')
(631231482, 'David')

In [ ]:
cursor=conn.execute('''
SELECT SSN, Name FROM  Employees
ORDER BY Department, Salary DESC;
  ''')
for row in cursor:
  print(row)

(332154719, 'Mary-Anne')
(845657246, 'Kumar')
(152934485, 'Anand')
(845657245, 'Elizabeth')
(222364883, 'Carol')
(326587417, 'Joe')
(546523478, 'John')
(654873219, 'Zacary')
(745685214, 'Eric')
(631231482, 'David')
(332569843, 'George')

In [ ]:
cursor=conn.execute('''
SELECT SSN, Name FROM  Employees
ORDER BY Department, Salary DESC;
LIMIT=5
  ''')
for row in cursor:
  print(row)

ProgrammingError: You can only execute one statement at a time.

In [ ]:
cursor=conn.execute('''
SELECT SSN, Name FROM  Employees
WHERE Name='John' OR SSN=326587417;
  ''')
for row in cursor:
  print(row)

(326587417, 'Joe')
(546523478, 'John')

In [ ]:
cursor=conn.execute('''
SELECT COUNT (SSN) FROM Employees;
  ''')
for row in cursor:
  print(row)

(11,)

In [ ]:
cursor=conn.execute('''
SELECT COUNT (SSN) FROM Employees
WHERE Salary>200;
  ''')
for row in cursor:
  print(row)

(6,)

In [ ]:
cursor=conn.execute('''
SELECT AVG(Salary) FROM Employees
WHERE Salary>200;
  ''')
for row in cursor:
  print(row);

(600.0,)

In [ ]:
cursor=conn.execute('''
SELECT SSN FROM Employees
WHERE SSN LIKE ' %65% ' ;
  ''')
for row in cursor:
  print(row);

In [ ]:
cursor=conn.execute('''
SELECT SSN FROM Employees
WHERE SSN LIKE ‘ __65% ;
  ''')
for row in cursor:
  print(row);

OperationalError: near "__65": syntax error